src/cf/InformationRegisters/СубъектыОбращенияМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СубъектыОбращенияМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторСубъектаОбращения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СобственнаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноОбратноеАкцептование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОрганизацияКонтрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМестаДеятельности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектМестаДеятельностиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/УведомлениеОВыбытииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УведомлениеОВыбытииМДЛП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииВыбытияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомленияОВыбытииМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВыводаИзОборота</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВыводаИзОборотаМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПодтверждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПолученыИзМДЛП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраныЭкспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУничтожения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУничтоженияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПередачиНаУничтожение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныПередачиНаУничтожениеМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументИнвентаризации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументИнвентаризацииМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСерии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоденДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПервичныхУпаковокВоВторичной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКИЗ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСостояниеПодтверждения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПервичныхУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУпаковки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСостояниеПодтверждения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/СобытияФормМДЛППереопределяемый/Ext/Module.bsl
#Область ОбработчикиСобытийОбъектов

// Обработчик события вызывается на сервере при получении стандартной управляемой формы.
// Если требуется переопределить выбор открываемой формы, необходимо установить в параметре <ВыбраннаяФорма>
// другое имя формы или объект метаданных формы, которую требуется открыть, и в параметре <СтандартнаяОбработка>
// установить значение Ложь.
//
// Параметры:
//  ИмяДокумента - Строка - имя документа, для которого открывается форма,
//  ВидФормы - Строка - имя стандартной формы,
//  Параметры - Структура - параметры формы,
//  ВыбраннаяФорма - Строка, ФормаКлиентскогоПриложения - содержит имя открываемой формы или объект метаданных Форма,
//  ДополнительнаяИнформация - Структура - дополнительная информация открытия формы,
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ПриПолученииФормыДокумента(ИмяДокумента, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	// +ор интеграция МДЛП
	Если Форма.ИмяФормы = "Обработка.ПанельМаркировкиМДЛП.Форма.ПанельМаркировки" Тогда
		
		//ГлавныйУзелпоРабочемуМесту = ПланыОбмена.ГлавныйУзел();
		//Если НЕ ГлавныйУзелпоРабочемуМесту = Неопределено
		//	И ТипЗнч(ГлавныйУзелпоРабочемуМесту) = Тип("ПланОбменаСсылка.ПоРабочемуМесту") Тогда
		//	
		//	Форма.Элементы.ВыполнитьОбмен.Видимость     = Ложь;
		//	Форма.Элементы.ГруппаНастройки.Видимость    = Ложь;
		//	Форма.Элементы.ГруппаОтборы.Видимость       = Ложь;
		//	Форма.Элементы.ГруппаПроизводство.Видимость = Ложь;
		//	Форма.Элементы.ГруппаЗакупки.Видимость      = Ложь;
		//	Форма.Элементы.ГруппаСклад.Видимость        = Ложь;
		//	
		//КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.МДЛППрисоединенныеФайлы.Форма.ПротоколОбмена" Тогда
		
		//ГлавныйУзелпоРабочемуМесту = ПланыОбмена.ГлавныйУзел();
		//Если НЕ ГлавныйУзелпоРабочемуМесту = Неопределено
		//	И ТипЗнч(ГлавныйУзелпоРабочемуМесту) = Тип("ПланОбменаСсылка.ПоРабочемуМесту") Тогда
		//	
		//	Форма.Элементы.СписокГруппаВыполнить.Видимость = Ложь;
		//	Форма.Элементы.ВыполнитьОбмен.Видимость        = Ложь;
		//	
		//КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Обработка.ПанельМаркировкиМДЛП.Форма.ФормаСпискаДокументов" Тогда
		
		//ГлавныйУзелпоРабочемуМесту = ПланыОбмена.ГлавныйУзел();
		//Если НЕ ГлавныйУзелпоРабочемуМесту = Неопределено
		//	И ТипЗнч(ГлавныйУзелпоРабочемуМесту) = Тип("ПланОбменаСсылка.ПоРабочемуМесту") Тогда
		//	
		//	Форма.Элементы.СписокПередатьДанные.Видимость = Ложь;
		//	Форма.Элементы.СписокВыполнитьОбмен.Видимость = Ложь;
		//	
		//КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Документ.УведомлениеОбОтгрузкеМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОПриемкеМДЛП.Форма.ФормаДокумента" Тогда
		
		//ГлавныйУзелпоРабочемуМесту = ПланыОбмена.ГлавныйУзел();
		//Если НЕ ГлавныйУзелпоРабочемуМесту = Неопределено
		//	И ТипЗнч(ГлавныйУзелпоРабочемуМесту) = Тип("ПланОбменаСсылка.ПоРабочемуМесту") Тогда
		//	
		//	Форма.Элементы.ФормаОтметитьКПередаче.Видимость = Ложь;
		//	
		//КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "РегистрСведений.СубъектыОбращенияМДЛП.Форма.ФормаЗаписи" Тогда
		
		Форма.Элементы.ОрганизацияМДЛП.Заголовок = НСтр("ru = 'Организация МДЛП'");
		Форма.Элементы.МестоДеятельностиМДЛП.Заголовок = НСтр("ru = 'Место деятельности МДЛП'");
		
	КонецЕсли;
	
	
	Если Форма.ИмяФормы = "Документ.УведомлениеОбАгрегированииИТрансформацииУпаковокМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОбОтгрузкеМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОВыбытииМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОВыдачеВОтделенияМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОПередачеНаУничтожениеМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОПеремещенииМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОПовторномВводеВОборотМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОПриемкеМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОРозничнойПродажеМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОФактеУничтоженияМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеОбОприходованииМДЛП.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.УведомлениеВладельцаОбОприходованииМДЛП.Форма.ФормаДокумента" Тогда
		
		// устанавливаем связи параметров выбора для поля "Упаковка" в таблице "Товары"
		Связь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы.Товары.ТекущиеДанные.Номенклатура");
		
		МассивСвязи = Новый Массив();
		МассивСвязи.Добавить(Связь);
		
		ФиксМассивСвязи = Новый ФиксированныйМассив(МассивСвязи);
		Форма.Элементы.ТоварыУпаковка.СвязиПараметровВыбора = ФиксМассивСвязи;
		
		// отключаем свойство "ВыбиратьТип"
		Форма.Элементы.ТоварыУпаковка.ВыбиратьТип = Ложь;
		
	КонецЕсли;
	
	
	ор_ИнтеграцияМДЛП.СоздатьКомандуРегистрацииGTINНаФорме(Форма);
	
	// -ор интеграция МДЛП
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодированиеНоменклатуры

// В процедуре требуется реализовать алгоритм обработки полученных штрихкодов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка,
//  ДанныеДляОбработки - Структура - подготовленные ранее данные для обработки,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
//
Процедура ОбработатьШтрихкоды(Форма, ДанныеДляОбработки, КэшированныеЗначения) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросИнформацииОбУпаковках

// В процедуре можно переопределить стандартный алгоритм обработки получения информации о потребительских упаковках для документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка.
//  Данные - Соответствие - данные, возвращаемые в результате функции ТранспортМДЛПАПИКлиентСервер.ПолучитьИнформациюОПотребительскихУпаковках.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ОбработатьПолучениеИнформацииОПотребительскихУпаковках(Форма, Данные, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// В процедуре можно переопределить стандартный алгоритм обработки получения информации о транспортных упаковках для документов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа, в которой происходит обработка.
//  Данные - Соответствие - данные, возвращаемые в результате функции ТранспортМДЛПАПИКлиентСервер.ПолучитьИнформациюОТранспортныхУпаковках.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
//
Процедура ОбработатьПолучениеИнформацииОТранспортныхУпаковках(Форма, Данные, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СверкаОстатков

// Выполняет запись изменений данных упаковок по данным МДЛП в обработке СверкаОстатковМДЛП.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется запись состава транспортных упаковок;
//  Объект - ДанныеФормыСтруктура - данные формы, из которых получаются изменения состава транспортных упаковок;
//  ИмяТабличнойЧасти - Строка - имя табличной части, из которой получаются изменения состава транспортных упаковок;
//  СтандартнаяОбработка - Булево - признак необходимости выполнения стандартных действий при записи изменений состава транспортных упаковок;
//
Процедура ЗаписатьРезультатСверкиОстатков(Форма, Объект, ИмяТабличнойЧасти, СтандартнаяОбработка) Экспорт
	
	// +ор интеграция МДЛП
	Если ИмяТабличнойЧасти = Метаданные.Обработки.СверкаОстатковМДЛП.ТабличныеЧасти.ДанныеТранспортныхУпаковок.Имя Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеУпаковок = Объект[ИмяТабличнойЧасти].Выгрузить(Новый Структура("ИзмененыДанныеНоменклатуры", Истина));
	Если ДанныеУпаковок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ор_ИнтеграцияМДЛП.ЗаписатьУпаковкиМаркируемогоТовара(ДанныеУпаковок);
	// -ор интеграция МДЛП
	
КонецПроцедуры

#КонецОбласти // СверкаОстатков

#Область ПолучениеСоставаТранспортныхУпаковок

// Выполняет запись изменений данных упаковок по данным МДЛП в обработке ПолучитьСоставТранспортныхУпаковокМДЛП.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой выполняется запись состава транспортных упаковок;
//  Объект - ДанныеФормыСтруктура - данные формы, из которых получаются изменения состава транспортных упаковок;
//  ИмяТабличнойЧасти - Строка - имя табличной части, из которой получаются изменения состава транспортных упаковок;
//  СтандартнаяОбработка - Булево - признак необходимости выполнения стандартных действий при записи изменений состава транспортных упаковок;
//
Процедура ЗаписатьРезультатПолученияСоставаТранспортныхУпаковок(Форма, Объект, ИмяТабличнойЧасти, СтандартнаяОбработка) Экспорт
	
	// +ор интеграция МДЛП
	ДанныеУпаковок = Объект[ИмяТабличнойЧасти].Выгрузить(Новый Структура("ИзмененыДанныеНоменклатуры", Истина));
	Если ДанныеУпаковок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ор_ИнтеграцияМДЛП.ЗаписатьУпаковкиМаркируемогоТовара(ДанныеУпаковок);
	// -ор интеграция МДЛП
	
КонецПроцедуры

#КонецОбласти // ПолучениеСоставаТранспортныхУпаковок
